Revit 2015 API
PartMakerMethodToDivideVolumes.DivisionRuleId Property
 Id of the 'DivisionRule' which is used to augment the cutting sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2013
Syntax
C#
public ElementId DivisionRuleId { get; set; }
Visual Basic
Public Property DivisionRuleId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ DivisionRuleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace